# Лабораторна робота №1. Основи Python
# Варіант: __ 9
# ПІБ: __ Ровний Максим Вікторович

# Тут має бути Ваш код
# Розробка програми для обчислення площі та периметру прямокутника.

# Введення даних з перевіркою на коректність
while True:
    try:
        time = float(input("Введіть час (год): "))
        km = float(input("Введіть відстань(км): "))
        if time <= 0 or km <= 0:
            raise ValueError("швидкість або час повинні бути додатними числами.")
        break
    except ValueError as e:
        print(f"Помилка: {e} Спробуйте ще раз.")

# Обчислення 
kmh = km / time

# Виведення результатів
print("\nРезультати обчислень:")
print(f"швидкість: {kmh:.2f} км/год")


# Додаткова інформація
if kmh == 67:
    print("Ця швидкість допустимо по селу!(хаха сикс севен)")
elif kmh == 300:
    print("Ця швидкість допустимо по дому.")
else:
    print("Ця швидкість не допустимо.")

